USE LibraryDB;

-- Book (DML)
INSERT INTO Book VALUES ('9789571379324','現代軟體工程','Ian Sommerville','介紹軟體工程理論與實務'),('9789862018812','網頁前端技術','John Duckett','學習 HTML、CSS 與 JavaScript 技術'),('9789863124536','資料結構與演算法分析','Clifford A. Shaffer','解析資料結構與演算法實作'),('9789863478745','深入淺出 Python','Mark Lutz','學習 Python 程式設計的入門書籍'),('9789864345008','資料庫系統概論','Abraham Silberschatz','資料庫系統與 SQL 概念');

-- Inventory (DML)
INSERT INTO Inventory VALUES (1,'9789863478745','2025-06-04 20:39:16','Available'),(2,'9789863478745','2025-06-04 20:39:16','Available'),(3,'9789863124536','2025-06-04 20:39:16','Available'),(4,'9789863124536','2025-06-04 20:39:16','Available'),(5,'9789571379324','2025-06-04 20:39:16','Available'),(6,'9789571379324','2025-06-04 20:39:16','Available'),(7,'9789862018812','2025-06-04 20:39:16','Available'),(8,'9789862018812','2025-06-04 20:39:16','Available'),(9,'9789864345008','2025-06-04 20:39:16','Available'),(10,'9789864345008','2025-06-04 20:39:16','Available');
